# Configuration de la connexion à la base de données

In [1]:
import pandas as pd 
import cx_Oracle
import sys
import os

%pylab inline
%load_ext sql

Populating the interactive namespace from numpy and matplotlib

In [2]:
sys.path.append(os.path.abspath('../../.'))
from dbconnect import utilisateur,connexion,password

# Connexion

In [3]:
%sql oracle+cx_oracle://$utilisateur:$password@$connexion

'Connected: stag01@coursdb'

# Fonctions d’agrégat
## SUM

In [4]:
%sql SELECT SUM(SALAIRE),SUM(COMMISSION) FROM EMPLOYES

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(1185440, 157690)]

## AVG

In [5]:
%sql SELECT AVG(COMMISSION),AVG(NVL(COMMISSION,0)) FROM EMPLOYES

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(Decimal('1609.081632653061224489795918367346938776'), Decimal('1420.630630630630630630630630630630630631'))]

## MIN

In [6]:
%sql SELECT MIN(UNITES_STOCK) MIN_STOCK, MIN(UNITES_COMMANDEES) MIN_COMM, MIN(NOM_PRODUIT) MIN_NOM FROM PRODUITS

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(0, 5, 'Alice Mutton')]

## MAX

In [7]:
%sql SELECT MAX(SALAIRE), MAX(COMMISSION), MAX(DATE_NAISSANCE) MAX_DATE, MAX(NOM) FROM EMPLOYES

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(150000, 16480, datetime.datetime(1991, 7, 31, 0, 0), 'Zonca')]

## COUNT

In [8]:
%sql SELECT COUNT(*), COUNT(FONCTION), COUNT(DISTINCT FONCTION), COUNT(COMMISSION) FROM EMPLOYES

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(111, 111, 5, 98)]

# Fonctions d’agrégat statistiques

## STDDEV et STDDEV_SAMP STDDEV_POP VARIANCE et VAR_SAMP VAR_POP

In [9]:
%%sql 
SELECT AVG(SALAIRE) MOYENNE, 
       STDDEV_POP(SALAIRE) STDDEV_POP,
       STDDEV_SAMP(SALAIRE) STDDEV_SAMP
FROM EMPLOYES

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(Decimal('10679.6396396396396396396396396396396396'), Decimal('20639.5774769906316810525493948056340267'), Decimal('20733.1814831784659805213784398197118069'))]

In [10]:
%%sql 
SELECT VAR_POP(SALAIRE) VAR_POP,
       VAR_SAMP(SALAIRE) VAR_SAMP,
       VARIANCE(SALAIRE) VARIANCE 
FROM EMPLOYES

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(Decimal('425992158.428698969239509780050320590862'), Decimal('429864814.414414414414414414414414414415'), Decimal('429864814.414414414414414414414414414415'))]

# Le groupe

<img src="https://raw.githubusercontent.com/rbizoi/IntelligenceEnDonneesDeSante/main/InterrogationSQL/images/M06-03.png" width="500">

In [11]:
%sql SELECT FONCTION, SUM(SALAIRE) FROM EMPLOYES GROUP BY FONCTION

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('Représentant(e)', 692900),
 ('Vice-Président', 243000),
 ('Président', 150000),
 ('Chef des ventes', 83000),
 ('Assistante commerciale', 16540)]

In [12]:
%%sql 
SELECT NO_FOURNISSEUR, 
       CODE_CATEGORIE, 
       SUM(UNITES_STOCK) SUM_STOCK,
       COUNT(CODE_CATEGORIE) NB_CATEG 
FROM PRODUITS 
GROUP BY NO_FOURNISSEUR, CODE_CATEGORIE 
ORDER BY NO_FOURNISSEUR, CODE_CATEGORIE 
FETCH FIRST 10 ROWS ONLY

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(1, 1, 56, 2),
 (1, 2, 13, 1),
 (2, 2, 133, 4),
 (2, 3, 20, 1),
 (2, 7, 20, 1),
 (2, 9, 40, 1),
 (3, 2, 126, 2),
 (3, 7, 15, 1),
 (4, 2, 60, 1),
 (4, 3, 20, 1)]

# La sélection de groupe

In [13]:
%%sql 
SELECT NO_EMPLOYE, 
       TO_CHAR(DATE_COMMANDE,' YYYY ') "Année", 
       TO_CHAR(SUM(PORT),'99G999D99')  "Port"  
FROM COMMANDES 
WHERE DATE_COMMANDE > '01/01/2011' AND NO_EMPLOYE <= 30 
GROUP BY NO_EMPLOYE, TO_CHAR(DATE_COMMANDE,' YYYY ') 
HAVING SUM(PORT) > 5000 
ORDER BY  SUM(PORT) DESC

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(29, ' 2011 ', ' 13 068,30'),
 (7, ' 2011 ', ' 11 680,30'),
 (1, ' 2011 ', '  6 976,90'),
 (4, ' 2011 ', '  5 805,30'),
 (22, ' 2011 ', '  5 464,40'),
 (3, ' 2011 ', '  5 051,30')]

# Atelier 6.1	Groupement des données
## Les fonctions d’agrégat
Écrivez les requêtes vous permettant d’afficher :

>> * La date du prochain dimanche (à ce jour).
>> * La valeur totale des produits en stock et la valeur totale des produits commandés.
>> * La valeur totale des produits vendus et le total du chiffre d’affaire, la valeur totale des produits vendus moins la remise. Le champ REMISE représente un pourcentage de remise.
>> * La masse salariale.

## Le groupement des données
Écrivez les requêtes permettant d’afficher :
>> * La masse salariale pour chaque fonction des employés.
>> * Le nombre des commandes et la somme des frais de port pour chaque client et par année et par mois.
>> * La somme totale des produits en stock et la somme totale des produits commandés par fournisseur et par catégorie des produits.

## La sélection de groupe
Écrivez les requêtes permettant d’afficher :
>> * La somme des produits en stock et la somme des produits commandés pour les fournisseurs qui ont un numéro compris entre 3 et 6 et qui vendent au moins trois catégories de produits.
>> * La somme totale des produits vendus et la somme du chiffre d’affaire pour les commandes qui comportent plus de 50 produits.
>> * Le nombre des commandes et la somme des frais de port pour chaque client et par année et par mois. Il faut afficher uniquement les clients qui ont commandé plus de quinze fois dans le mois et dont leur frais de port dans le mois sont supérieurs à 1400€.

# Groupage ROLLUP


<img src="https://raw.githubusercontent.com/rbizoi/IntelligenceEnDonneesDeSante/main/InterrogationSQL/images/rollup.png" width="500">

In [14]:
%sql SELECT FONCTION, SUM(SALAIRE) FROM EMPLOYES GROUP BY ROLLUP(FONCTION)

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('Assistante commerciale', 16540),
 ('Chef des ventes', 83000),
 ('Président', 150000),
 ('Représentant(e)', 692900),
 ('Vice-Président', 243000),
 (None, 1185440)]

In [15]:
%%sql 
SELECT FONCTION, 
       PAYS, 
       SUM(SALAIRE) sum_salaire
FROM EMPLOYES 
GROUP BY ROLLUP(FONCTION, PAYS)

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('Président', None, 150000),
 ('Président', None, 150000),
 ('Chef des ventes', None, 83000),
 ('Chef des ventes', None, 83000),
 ('Vice-Président', None, 243000),
 ('Vice-Président', None, 243000),
 ('Représentant(e)', 'Canada', 35500),
 ('Représentant(e)', 'France', 32200),
 ('Représentant(e)', 'Italie', 29000),
 ('Représentant(e)', 'Suisse', 36700),
 ('Représentant(e)', 'Suède', 31300),
 ('Représentant(e)', 'Brésil', 23100),
 ('Représentant(e)', 'Espagne', 36700),
 ('Représentant(e)', 'Irlande', 36400),
 ('Représentant(e)', 'Mexique', 28900),
 ('Représentant(e)', 'Pologne', 32400),
 ('Représentant(e)', 'Autriche', 25600),
 ('Représentant(e)', 'Belgique', 27000),
 ('Représentant(e)', 'Danemark', 27500),
 ('Représentant(e)', 'Finlande', 29800),
 ('Représentant(e)', 'Norvège', 35300),
 ('Représentant(e)', 'Portugal', 31600),
 ('Représentant(e)', 'Allemagne', 51200),
 ('Représentant(e)', 'Argentine', 38900),
 ('Représentant(e)', 'Venezuela', 37800),
 ('Représentant(e)', 'Royaume-Uni', 42900),
 ('Représentant(e)', 'États-Unis', 23100),
 ('Représentant(e)', None, 692900),
 ('Assistante commerciale', None, 16540),
 ('Assistante commerciale', None, 16540),
 (None, None, 1185440)]

In [16]:
%%sql 
SELECT CODE_CLIENT, 
       ANNEE, 
       TRIMESTRE, 
       SUM(PORT) PORT 
FROM COMMANDES 
WHERE CODE_CLIENT IN ('ALFKI','ANTON') 
GROUP BY ROLLUP( CODE_CLIENT, ANNEE, TRIMESTRE )

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('ALFKI', 2010, 1, Decimal('2444.3')),
 ('ALFKI', 2010, 2, Decimal('2028.9')),
 ('ALFKI', 2010, 3, Decimal('1261.7')),
 ('ALFKI', 2010, 4, Decimal('1370.9')),
 ('ALFKI', 2010, None, Decimal('7105.8')),
 ('ALFKI', 2011, 1, Decimal('1738.6')),
 ('ALFKI', 2011, 2, Decimal('1772.7')),
 ('ALFKI', 2011, None, Decimal('3511.3')),
 ('ALFKI', None, None, Decimal('10617.1')),
 ('ANTON', 2010, 1, Decimal('877.6')),
 ('ANTON', 2010, 2, Decimal('2111.1')),
 ('ANTON', 2010, 3, Decimal('1650.4')),
 ('ANTON', 2010, 4, Decimal('2328.8')),
 ('ANTON', 2010, None, Decimal('6967.9')),
 ('ANTON', 2011, 1, Decimal('2248.1')),
 ('ANTON', 2011, 2, Decimal('1526.1')),
 ('ANTON', 2011, None, Decimal('3774.2')),
 ('ANTON', None, None, Decimal('10742.1')),
 (None, None, None, Decimal('21359.2'))]

In [17]:
%%sql 
SELECT CODE_CLIENT, 
       ANNEE, 
       TRIMESTRE, 
       SUM(PORT) PORT 
FROM COMMANDES 
WHERE CODE_CLIENT IN ('ALFKI','ANTON') 
GROUP BY CODE_CLIENT, ROLLUP( ANNEE, TRIMESTRE )

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('ALFKI', 2010, 1, Decimal('2444.3')),
 ('ALFKI', 2010, 2, Decimal('2028.9')),
 ('ALFKI', 2010, 3, Decimal('1261.7')),
 ('ALFKI', 2010, 4, Decimal('1370.9')),
 ('ALFKI', 2010, None, Decimal('7105.8')),
 ('ALFKI', 2011, 1, Decimal('1738.6')),
 ('ALFKI', 2011, 2, Decimal('1772.7')),
 ('ALFKI', 2011, None, Decimal('3511.3')),
 ('ALFKI', None, None, Decimal('10617.1')),
 ('ANTON', 2010, 1, Decimal('877.6')),
 ('ANTON', 2010, 2, Decimal('2111.1')),
 ('ANTON', 2010, 3, Decimal('1650.4')),
 ('ANTON', 2010, 4, Decimal('2328.8')),
 ('ANTON', 2010, None, Decimal('6967.9')),
 ('ANTON', 2011, 1, Decimal('2248.1')),
 ('ANTON', 2011, 2, Decimal('1526.1')),
 ('ANTON', 2011, None, Decimal('3774.2')),
 ('ANTON', None, None, Decimal('10742.1'))]

# Groupage CUBE

<img src="https://raw.githubusercontent.com/rbizoi/IntelligenceEnDonneesDeSante/main/InterrogationSQL/images/cube.png" width="500">

In [18]:
%%sql 
SELECT CODE_CLIENT, 
       ANNEE, 
       TRIMESTRE, 
       SUM(PORT) PORT 
FROM COMMANDES 
WHERE CODE_CLIENT IN ('ALFKI','ANTON') 
GROUP BY CUBE( CODE_CLIENT, ANNEE, TRIMESTRE )

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(None, None, None, Decimal('21359.2')),
 (None, None, 1, Decimal('7308.6')),
 (None, None, 2, Decimal('7438.8')),
 (None, None, 3, Decimal('2912.1')),
 (None, None, 4, Decimal('3699.7')),
 (None, 2010, None, Decimal('14073.7')),
 (None, 2010, 1, Decimal('3321.9')),
 (None, 2010, 2, 4140),
 (None, 2010, 3, Decimal('2912.1')),
 (None, 2010, 4, Decimal('3699.7')),
 (None, 2011, None, Decimal('7285.5')),
 (None, 2011, 1, Decimal('3986.7')),
 (None, 2011, 2, Decimal('3298.8')),
 ('ALFKI', None, None, Decimal('10617.1')),
 ('ALFKI', None, 1, Decimal('4182.9')),
 ('ALFKI', None, 2, Decimal('3801.6')),
 ('ALFKI', None, 3, Decimal('1261.7')),
 ('ALFKI', None, 4, Decimal('1370.9')),
 ('ALFKI', 2010, None, Decimal('7105.8')),
 ('ALFKI', 2010, 1, Decimal('2444.3')),
 ('ALFKI', 2010, 2, Decimal('2028.9')),
 ('ALFKI', 2010, 3, Decimal('1261.7')),
 ('ALFKI', 2010, 4, Decimal('1370.9')),
 ('ALFKI', 2011, None, Decimal('3511.3')),
 ('ALFKI', 2011, 1, Decimal('1738.6')),
 ('ALFKI', 2011, 2, Decimal('1772.7')),
 ('ANTON', None, None, Decimal('10742.1')),
 ('ANTON', None, 1, Decimal('3125.7')),
 ('ANTON', None, 2, Decimal('3637.2')),
 ('ANTON', None, 3, Decimal('1650.4')),
 ('ANTON', None, 4, Decimal('2328.8')),
 ('ANTON', 2010, None, Decimal('6967.9')),
 ('ANTON', 2010, 1, Decimal('877.6')),
 ('ANTON', 2010, 2, Decimal('2111.1')),
 ('ANTON', 2010, 3, Decimal('1650.4')),
 ('ANTON', 2010, 4, Decimal('2328.8')),
 ('ANTON', 2011, None, Decimal('3774.2')),
 ('ANTON', 2011, 1, Decimal('2248.1')),
 ('ANTON', 2011, 2, Decimal('1526.1'))]

# GROUPING SETS

<img src="https://raw.githubusercontent.com/rbizoi/IntelligenceEnDonneesDeSante/main/InterrogationSQL/images/grouping_sets.png" width="500">

In [19]:
%%sql 
SELECT CODE_CLIENT, 
       ANNEE, 
       MOIS, 
       SUM(PORT) PORT 
FROM COMMANDES 
WHERE CODE_CLIENT BETWEEN 'ALFKI' AND 'BLONP' 
GROUP BY GROUPING SETS( CODE_CLIENT, ANNEE, MOIS) 
ORDER BY CODE_CLIENT, ANNEE, MOIS

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('ALFKI', None, None, Decimal('10617.1')),
 ('ANATR', None, None, Decimal('10653.1')),
 ('ANTON', None, None, Decimal('10742.1')),
 ('AROUT', None, None, Decimal('12944.5')),
 ('BERGS', None, None, Decimal('11969.2')),
 ('BLAUS', None, None, Decimal('9724.5')),
 ('BLONP', None, None, Decimal('10413.4')),
 (None, 2010, None, Decimal('44890.1')),
 (None, 2011, None, Decimal('32173.8')),
 (None, None, 1, Decimal('5979.3')),
 (None, None, 2, 10228),
 (None, None, 3, Decimal('9514.7')),
 (None, None, 4, Decimal('10183.1')),
 (None, None, 5, 9474),
 (None, None, 6, Decimal('8575.9')),
 (None, None, 7, Decimal('3654.5')),
 (None, None, 8, Decimal('3296.1')),
 (None, None, 9, Decimal('2642.4')),
 (None, None, 10, Decimal('5282.2')),
 (None, None, 11, 4086),
 (None, None, 12, Decimal('4147.7'))]

In [20]:
%%sql 
SELECT CODE_CLIENT, 
       ANNEE, 
       TRIMESTRE, 
       SUM(PORT) PORT 
FROM COMMANDES 
WHERE CODE_CLIENT BETWEEN 'ALFKI' AND 'AROUT'
GROUP BY GROUPING SETS( (CODE_CLIENT,ANNEE), (ANNEE,TRIMESTRE), ())
ORDER BY CODE_CLIENT, ANNEE, TRIMESTRE

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('ALFKI', 2010, None, Decimal('7105.8')),
 ('ALFKI', 2011, None, Decimal('3511.3')),
 ('ANATR', 2010, None, Decimal('6120.6')),
 ('ANATR', 2011, None, Decimal('4532.5')),
 ('ANTON', 2010, None, Decimal('6967.9')),
 ('ANTON', 2011, None, Decimal('3774.2')),
 ('AROUT', 2010, None, Decimal('7440.5')),
 ('AROUT', 2011, None, 5504),
 (None, 2010, 1, Decimal('6873.9')),
 (None, 2010, 2, Decimal('7011.6')),
 (None, 2010, 3, Decimal('6232.7')),
 (None, 2010, 4, Decimal('7516.6')),
 (None, 2011, 1, Decimal('8045.8')),
 (None, 2011, 2, Decimal('9276.2')),
 (None, None, None, Decimal('44956.8'))]

# Fonctions de groupes
## GROUPING

In [21]:
%%sql 
SELECT GROUPING(NO_FOURNISSEUR) "GF",
       GROUPING(CODE_CATEGORIE) "GC",
       NO_FOURNISSEUR "Fournisseur",
       CODE_CATEGORIE "Catégorie",
       SUM(UNITES_STOCK) "Stock" 
FROM PRODUITS 
GROUP BY GROUPING SETS(ROLLUP(NO_FOURNISSEUR), CODE_CATEGORIE) 
ORDER BY NO_FOURNISSEUR, CODE_CATEGORIE

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(0, 1, 1, None, 69),
 (0, 1, 2, None, 213),
 (0, 1, 3, None, 141),
 (0, 1, 4, None, 255),
 (0, 1, 5, None, 228),
 (0, 1, 6, None, 298),
 (0, 1, 7, None, 130),
 (0, 1, 8, None, 149),
 (0, 1, 9, None, 165),
 (0, 1, 10, None, None),
 (0, 1, 11, None, 240),
 (0, 1, 12, None, 179),
 (0, 1, 13, None, 75),
 (0, 1, 14, None, 408),
 (0, 1, 15, None, 164),
 (0, 1, 16, None, 423),
 (0, 1, 17, None, 324),
 (0, 1, 18, None, 246),
 (0, 1, 19, None, 328),
 (0, 1, 20, None, 64),
 (0, 1, 21, None, 180),
 (0, 1, 22, None, 51),
 (0, 1, 23, None, 332),
 (0, 1, 24, None, 98),
 (0, 1, 25, None, 176),
 (0, 1, 26, None, 197),
 (0, 1, 27, None, 192),
 (0, 1, 28, None, 98),
 (0, 1, 29, None, 130),
 (1, 0, None, 1, 874),
 (1, 0, None, 2, 1032),
 (1, 0, None, 3, 466),
 (1, 0, None, 4, 433),
 (1, 0, None, 5, 642),
 (1, 0, None, 6, 136),
 (1, 0, None, 7, 589),
 (1, 0, None, 8, 701),
 (1, 0, None, 9, 460),
 (1, 0, None, 10, 220),
 (1, 1, None, None, 5553)]

## GROUPING_ID

In [22]:
%%sql 
SELECT GROUPING(CODE_CLIENT) "GC", 
       GROUPING(ANNEE) "GA",
       GROUPING(TRIMESTRE)"GT",
       GROUPING_ID(CODE_CLIENT,ANNEE,TRIMESTRE)"GI",
       CODE_CLIENT CLIENT, 
       ANNEE, 
       TRIMESTRE, 
       SUM(PORT) PORT 
FROM COMMANDES 
WHERE CODE_CLIENT BETWEEN 'ALFKI' AND 'ANTON'
GROUP BY  ROLLUP(CODE_CLIENT,ANNEE,TRIMESTRE)

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(0, 0, 0, 0, 'ALFKI', 2010, 1, Decimal('2444.3')),
 (0, 0, 0, 0, 'ALFKI', 2010, 2, Decimal('2028.9')),
 (0, 0, 0, 0, 'ALFKI', 2010, 3, Decimal('1261.7')),
 (0, 0, 0, 0, 'ALFKI', 2010, 4, Decimal('1370.9')),
 (0, 0, 1, 1, 'ALFKI', 2010, None, Decimal('7105.8')),
 (0, 0, 0, 0, 'ALFKI', 2011, 1, Decimal('1738.6')),
 (0, 0, 0, 0, 'ALFKI', 2011, 2, Decimal('1772.7')),
 (0, 0, 1, 1, 'ALFKI', 2011, None, Decimal('3511.3')),
 (0, 1, 1, 3, 'ALFKI', None, None, Decimal('10617.1')),
 (0, 0, 0, 0, 'ANATR', 2010, 1, Decimal('1768.3')),
 (0, 0, 0, 0, 'ANATR', 2010, 2, 1137),
 (0, 0, 0, 0, 'ANATR', 2010, 3, Decimal('1628.7')),
 (0, 0, 0, 0, 'ANATR', 2010, 4, Decimal('1586.6')),
 (0, 0, 1, 1, 'ANATR', 2010, None, Decimal('6120.6')),
 (0, 0, 0, 0, 'ANATR', 2011, 1, Decimal('2059.2')),
 (0, 0, 0, 0, 'ANATR', 2011, 2, Decimal('2473.3')),
 (0, 0, 1, 1, 'ANATR', 2011, None, Decimal('4532.5')),
 (0, 1, 1, 3, 'ANATR', None, None, Decimal('10653.1')),
 (0, 0, 0, 0, 'ANTON', 2010, 1, Decimal('877.6')),
 (0, 0, 0, 0, 'ANTON', 2010, 2, Decimal('2111.1')),
 (0, 0, 0, 0, 'ANTON', 2010, 3, Decimal('1650.4')),
 (0, 0, 0, 0, 'ANTON', 2010, 4, Decimal('2328.8')),
 (0, 0, 1, 1, 'ANTON', 2010, None, Decimal('6967.9')),
 (0, 0, 0, 0, 'ANTON', 2011, 1, Decimal('2248.1')),
 (0, 0, 0, 0, 'ANTON', 2011, 2, Decimal('1526.1')),
 (0, 0, 1, 1, 'ANTON', 2011, None, Decimal('3774.2')),
 (0, 1, 1, 3, 'ANTON', None, None, Decimal('10742.1')),
 (1, 1, 1, 7, None, None, None, Decimal('32012.3'))]

## GROUP_ID

In [23]:
%%sql 
SELECT GROUP_ID() GROUP_ID,
CODE_CLIENT,
ANNEE,
TRIMESTRE,
SUM(PORT) PORT
FROM COMMANDES 
WHERE CODE_CLIENT BETWEEN 'ALFKI' AND 'ANTON'
GROUP BY GROUPING SETS(CUBE(CODE_CLIENT,ANNEE),CUBE(ANNEE,TRIMESTRE))

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(0, None, None, 1, Decimal('11136.1')),
 (0, None, None, 2, Decimal('11049.1')),
 (0, None, None, 3, Decimal('4540.8')),
 (0, None, None, 4, Decimal('5286.3')),
 (0, 'ALFKI', 2010, None, Decimal('7105.8')),
 (0, 'ALFKI', 2011, None, Decimal('3511.3')),
 (0, 'ALFKI', None, None, Decimal('10617.1')),
 (0, 'ANATR', 2010, None, Decimal('6120.6')),
 (0, 'ANATR', 2011, None, Decimal('4532.5')),
 (0, 'ANATR', None, None, Decimal('10653.1')),
 (0, 'ANTON', 2010, None, Decimal('6967.9')),
 (0, 'ANTON', 2011, None, Decimal('3774.2')),
 (0, 'ANTON', None, None, Decimal('10742.1')),
 (0, None, 2010, 1, Decimal('5090.2')),
 (0, None, 2011, 1, Decimal('6045.9')),
 (0, None, 2010, 2, 5277),
 (0, None, 2011, 2, Decimal('5772.1')),
 (0, None, 2010, 3, Decimal('4540.8')),
 (0, None, 2010, 4, Decimal('5286.3')),
 (0, None, 2010, None, Decimal('20194.3')),
 (0, None, 2011, None, 11818),
 (1, None, 2010, None, Decimal('20194.3')),
 (1, None, 2011, None, 11818),
 (0, None, None, None, Decimal('32012.3')),
 (1, None, None, None, Decimal('32012.3'))]

In [24]:
%%sql 
SELECT GROUP_ID() GROUP_ID,
CODE_CLIENT,
ANNEE,
TRIMESTRE,
SUM(PORT) PORT
FROM COMMANDES 
WHERE CODE_CLIENT BETWEEN 'ALFKI' AND 'ANTON'
GROUP BY GROUPING SETS(CUBE(CODE_CLIENT,ANNEE),CUBE(ANNEE,TRIMESTRE))
HAVING GROUP_ID() = 0

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(0, None, None, 1, Decimal('11136.1')),
 (0, None, None, 2, Decimal('11049.1')),
 (0, None, None, 3, Decimal('4540.8')),
 (0, None, None, 4, Decimal('5286.3')),
 (0, 'ALFKI', 2010, None, Decimal('7105.8')),
 (0, 'ALFKI', 2011, None, Decimal('3511.3')),
 (0, 'ALFKI', None, None, Decimal('10617.1')),
 (0, 'ANATR', 2010, None, Decimal('6120.6')),
 (0, 'ANATR', 2011, None, Decimal('4532.5')),
 (0, 'ANATR', None, None, Decimal('10653.1')),
 (0, 'ANTON', 2010, None, Decimal('6967.9')),
 (0, 'ANTON', 2011, None, Decimal('3774.2')),
 (0, 'ANTON', None, None, Decimal('10742.1')),
 (0, None, 2010, 1, Decimal('5090.2')),
 (0, None, 2011, 1, Decimal('6045.9')),
 (0, None, 2010, 2, 5277),
 (0, None, 2011, 2, Decimal('5772.1')),
 (0, None, 2010, 3, Decimal('4540.8')),
 (0, None, 2010, 4, Decimal('5286.3')),
 (0, None, 2010, None, Decimal('20194.3')),
 (0, None, 2011, None, 11818),
 (0, None, None, None, Decimal('32012.3'))]